# Задание 1
вид = input("Введите вид питомца: ")
кличка = input("Введите кличку питомца: ")
возраст = input("Введите вораст питомца: ")
print("Это " + вид + " по кличке '" + кличка + "'. Возраст: " + возраст + " года.")
