# Задание 1
type = input("Введите вид питомца: ")
nickname = input("Введите кличку питомца: ")
age = input("Введите вораст питомца: ")
print("Это " + type + " по кличке '" + nickname + "'. Возраст: " + age + " года.")


# Задание 2
a1 = "homo habilis"
a2 = "homo erectus"
a3 = "homo erectus"
a4 = "homo heidelbergensis"
a5 = "Homo sapiens neanderthalensis"
a6 = "homo sapiens"
print(a1, a2, a3, a4, a5, a6, sep="=>")
